[
    {
        "nomProjet": "Hako Shi",
        "date": "2024",
        "descriptionProjet": "Site de vente de sushi",
        "explicationTecno": "Developement Web, Angular",
        "videoFond": "../../../../assets/img/videoPreview-card/sushi-video-track.mp4",
        "backgroundColor": "#dad1c8",
        "colortexte": "#202020",
        "textHeader": "Site De Vente De Sushi",
        "image1": "../../../../assets/img/projet-detail/hakoshi/hero.png",
        "image2": "../../../../assets/img/projet-detail/hakoshi/admin.png",
        "video1": "../../../../assets/video-detail-projet/hakoshi/hakoshi-presentation.mp4",
        "DescriptionProjet": "Notre projet consistait à développer une application web de gestion de commandes pour un restaurant de sushi en ligne. L'objectif était de créer une plateforme conviviale qui permet aux clients de passer des commandes facilement et au personnel de gérer efficacement les commandes et les produits.",
        "Objectifs": [
            "Offrir aux clients une expérience de commande fluide et intuitive.",
            "Fournir au personnel du restaurant un outil de gestion efficace pour suivre les commandes et gérer les produits.",
            "Assurer la sécurité des données des clients et la confidentialité de leurs informations personnelles.",
            "Livrer un produit fonctionnel et de haute qualité dans les délais impartis."
        ],
        "TechnologiesUtilisees": [
            "Angular : Framework front-end utilisé pour développer l'interface utilisateur interactive de l'application.",
            "PHP : Langage de programmation utilisé pour créer l'API REST back-end permettant la communication entre le front-end et la base de données.",
            "HTML et CSS (SASS/SCSS) : Utilisés pour la conception et le style de l'interface utilisateur, en suivant les principes du design responsive pour une expérience multiplateforme.",
            "Git : Utilisé pour le contrôle de version du code source et la collaboration entre les membres de l'équipe de développement."
        ],
        "FonctionnalitePrincipales": [
            "Interface utilisateur intuitive : Permet aux clients de parcourir le menu, d'ajouter des produits au panier et de passer des commandes en quelques clics.",
            "Gestion du panier : Les clients peuvent ajouter, supprimer et modifier les articles dans leur panier avant de finaliser leur commande.",
            "Tableau de bord administratif : Permet au personnel du restaurant de gérer les produits, les commandes et les utilisateurs, ainsi que de visualiser des rapports et des statistiques.",
            "Authentification sécurisée : Les utilisateurs peuvent créer un compte, se connecter de manière sécurisée et accéder à leur historique de commandes.",
            "Communication avec l'API REST : Utilisation d'une API RESTful pour récupérer et envoyer des données entre le front-end et le back-end de manière efficace et sécurisée."
        ],
        "Rolesetresponsabilites": "",
        "ResultatsObtenus": "Notre équipe a livré avec succès une application web de gestion de commandes de sushi fonctionnelle et robuste, répondant aux besoins spécifiques du restaurant et offrant une expérience utilisateur agréable. L'application a été bien reçue par les clients et le personnel, et elle continue de fonctionner de manière fiable, contribuant ainsi à la croissance et au succès du restaurant."
    },
    {
        "nomProjet": "Tatoo Samon",
        "date": "2023",
        "descriptionProjet": "Landing Page",
        "explicationTecno": "Developement Web, HTML, CSS, JS",
        "videoFond": "../../../../assets/img/videoPreview-card/tatto.mp4",
        "backgroundColor": "#31291e",
        "colortexte": "white"
    },
    {
        "nomProjet": "Cosmos",
        "date": "2023",
        "descriptionProjet": "Landing Page",
        "explicationTecno": "Developement Web, HTML, CSS, JS",
        "videoFond": "../../../../assets/img/videoPreview-card/tablette.mp4",
        "backgroundColor": "#A9C2CB",
        "colortexte": "white"
    }
]